<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads CDM+ and imports into Munki.</string>
	<key>Input</key>
	<dict>
		<key>IDENTIFIER</key>
		<string>com.github.cabal95.munki.CDMPlus</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>CDM+</string>
		<key>CDM_MAJOR_VERSION</key>
		<string>10</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>CDM+ is a dynamic system for complete church information management that is ideal for other faith-based ministries and non-profit organizations, too. CDM+ is powerful database software that not only lets you easily and efficiently enter data but also allows you to get that information out in highly customizable reports that will truly make a difference in your ministry.</string>
			<key>developer</key>
			<string>Suran Systems</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SuranURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/mpkg</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/mpkg/CDM+.pkg/Payload</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistEditor</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg/Applications/CDM+.app/Contents/Info.plist</string>
				<key>output_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg/Applications/CDM+.app/Contents/Info.plist</string>
				<key>plist_data</key>
				<dict>
					<key>CFBundleVersion</key>
					<string>%cdm_build%</string>
					<key>CFBundleShortVersionString</key>
					<string>%cdm_version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/pkg/Applications</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_megabytes</key>
				<string>350</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--mode</string>
					<string>a+rw</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
