<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Lenox ScriptQ disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.cabal95.munki.lenoxscriptq</string>
    <key>Input</key>
    <dict>
        <key>DISPLAYNAME</key>
        <string>Lenox ScriptQ5</string>
        <key>NAME</key>
        <string>LenoxScriptQ5</string>
        <key>CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>SN1S</key>
        <string>0000</string>
        <key>SN2S</key>
        <string>0000</string>
        <key>SN3S</key>
        <string>0000</string>
        <key>SN4S</key>
        <string>0000</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Script-Q is the premier teleprompter program for the most demanding professional teleprompting uses. It has many studio teleprompter uses, such as radio, television, and multimedia production; business/government presentations; student audio-visual classes, video-blogging, and videoconferencing.</string>
            <key>display_name</key>
            <string>%DISPLAYNAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%CATEGORY%</string>
            <key>RestartAction</key>
            <string>RequireRestart</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.cabal95.pkg.lenoxscriptq</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
