<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Lenox ScriptQ disk image and makes a pkg.</string>
    <key>Identifier</key>
    <string>com.github.cabal95.pkg.lenoxscriptq</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Lenox ScriptQ5</string>
        <key>SN1S</key>
        <string>0000</string>
        <key>SN2S</key>
        <string>0000</string>
        <key>SN3S</key>
        <string>0000</string>
        <key>SN4S</key>
        <string>0000</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.cabal95.download.lenoxscriptq</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/Preferences</key>
                    <string>0755</string>
                    <key>Library/LaunchAgents</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/ScriptQ5.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/ScriptQ5.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>/Volumes/munki/recipes/LenoxScriptQ_Files/com.github.cabal95.lenoxscriptq.register.plist</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/LaunchAgents/com.github.cabal95.lenoxscriptq.register.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%pkgroot%/Library/Preferences/com.lenox.scriptq.template</string>
                <key>file_content</key>
                <string>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;TransportableItem&gt;&lt;dictionary&gt;&lt;item&gt;&lt;key&gt;SN1S&lt;/key&gt;&lt;string&gt;%SN1S%&lt;/string&gt;&lt;/item&gt;&lt;item&gt;&lt;key&gt;SN2S&lt;/key&gt;&lt;string&gt;%SN2S%&lt;/string&gt;&lt;/item&gt;&lt;item&gt;&lt;key&gt;SN3S&lt;/key&gt;&lt;string&gt;%SN3S%&lt;/string&gt;&lt;/item&gt;&lt;item&gt;&lt;key&gt;SN4S&lt;/key&gt;&lt;string&gt;%SN4S%&lt;/string&gt;&lt;/item&gt;&lt;/dictionary&gt;&lt;/TransportableItem&gt;</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/Preferences/</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/LaunchAgents/</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
